Autodesk.Revit.DB.ElementCreationModeForImport
Controls when to create an Element while importing data via ATF.

Autodesk.Revit.DB.ElementCreationModeForImport.OneElementPerEntity
Create one Element for each object identified as an entity.

Autodesk.Revit.DB.ElementCreationModeForImport.OneElementPerTopLevelChild
Create one Element for each top-level child.

Autodesk.Revit.DB.ElementCreationModeForImport.OneElementPerModel
Creates one Element from the entire model.